Revit 2027 API
ParameterTypeId.BoundaryAreaRestraintZ Property
 "Z Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryAreaRestraintZ { get; }
Public Shared ReadOnly Property BoundaryAreaRestraintZ As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryAreaRestraintZ {
	ForgeTypeId^ get ();
}
static member BoundaryAreaRestraintZ : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace